-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июл 12 2023 г., 10:15
-- Версия сервера: 10.4.27-MariaDB
-- Версия PHP: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `fizo`
--

-- --------------------------------------------------------

--
-- Структура таблицы `1guruh`
--

CREATE TABLE `1guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `1-mashq` decimal(4,2) DEFAULT NULL,
  `2-mashq` decimal(4,2) DEFAULT NULL,
  `3-mashq` decimal(4,2) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `5b-mashq` decimal(4,2) DEFAULT NULL,
  `6a-mashq` decimal(4,2) DEFAULT NULL,
  `7a-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `10-mashq` int(11) DEFAULT NULL,
  `131-mashq` int(11) DEFAULT NULL,
  `132-mashq` int(11) DEFAULT NULL,
  `141-mashq` int(11) DEFAULT NULL,
  `142-mashq` int(11) DEFAULT NULL,
  `143-mashq` int(11) DEFAULT NULL,
  `144-mashq` int(11) DEFAULT NULL,
  `16-mashq` decimal(4,2) DEFAULT NULL,
  `23-mashq` int(11) DEFAULT NULL,
  `251-mashq` decimal(4,2) DEFAULT NULL,
  `252-mashq` decimal(4,2) DEFAULT NULL,
  `261-mashq` decimal(4,2) DEFAULT NULL,
  `262-mashq` decimal(4,2) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL,
  `31-mashq` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `1guruh`
--

INSERT INTO `1guruh` (`id`, `ball`, `1-mashq`, `2-mashq`, `3-mashq`, `4-mashq`, `5b-mashq`, `6a-mashq`, `7a-mashq`, `8a-mashq`, `9-mashq`, `10-mashq`, `131-mashq`, `132-mashq`, `141-mashq`, `142-mashq`, `143-mashq`, `144-mashq`, `16-mashq`, `23-mashq`, `251-mashq`, `252-mashq`, `261-mashq`, `262-mashq`, `27a-mashq`, `31-mashq`) VALUES
(1, 1, '27.80', '15.40', '1.16', '4.14', '13.50', '24.00', '14.10', 44, 8, 3, 10, 8, 20, 26, 32, 40, '10.20', 6, '26.20', '58.20', '2.24', '3.30', '2.36', 38),
(2, 2, '27.60', '15.30', '1.16', '4.10', '13.45', '23.50', '14.90', 44, 8, 3, 10, 8, 21, 27, 33, 41, '10.10', 6, '26.10', '58.10', '2.23', '3.25', '2.32', 39),
(3, 3, '27.40', '15.20', '1.15', '4.06', '13.40', '23.40', '14.07', 45, 9, 3, 9, 11, 22, 28, 34, 42, '10.00', 7, '26.00', '58.00', '2.22', '3.22', '2.28', 40),
(4, 4, '27.30', '15.10', '1.15', '4.02', '13.35', '23.30', '14.04', 44, 9, 4, 9, 11, 23, 29, 35, 43, '9.90', 7, '25.50', '57.40', '2.21', '3.19', '2.24', 40),
(5, 5, '27.20', '15.00', '1.14', '3.58', '13.30', '23.20', '14.01', 45, 10, 4, 10, 12, 24, 30, 36, 44, '9.80', 8, '25.40', '57.20', '2.20', '3.16', '2.20', 41),
(6, 6, '27.10', '14.90', '1.14', '3.54', '13.25', '23.10', '13.58', 46, 10, 4, 10, 12, 25, 31, 37, 45, '9.70', 8, '25.30', '57.00', '2.19', '3.13', '2.16', 41),
(7, 7, '27.00', '14.80', '1.13', '3.50', '13.20', '23.00', '13.55', 47, 11, 5, 11, 13, 26, 32, 38, 46, '9.60', 9, '25.20', '56.40', '2.18', '3.10', '2.12', 42),
(8, 8, '26.90', '14.70', '1.13', '3.46', '13.15', '22.50', '13.52', 48, 11, 5, 11, 13, 27, 33, 39, 47, '9.50', 9, '25.10', '56.20', '2.17', '3.07', '2.08', 42),
(9, 9, '26.80', '14.60', '1.12', '3.43', '13.10', '22.40', '13.49', 49, 12, 6, 12, 14, 28, 34, 40, 48, '9.40', 10, '25.00', '56.00', '2.16', '3.04', '2.04', 43),
(10, 10, '26.70', '14.50', '1.12', '3.40', '13.05', '22.30', '13.46', 49, 12, 6, 12, 14, 29, 35, 41, 49, '9.30', 10, '24.50', '55.40', '2.15', '3.01', '2.00', 43),
(11, 11, '26.60', '14.40', '1.11', '3.38', '13.00', '22.20', '13.43', 50, 13, 6, 13, 15, 30, 36, 42, 50, '9.20', 11, '24.40', '55.20', '2.14', '2.58', '1.57', 44),
(12, 12, '26.50', '14.30', '1.11', '3.36', '12.55', '22.10', '13.40', 50, 13, 7, 13, 15, 31, 37, 43, 51, '9.10', 11, '24.30', '55.00', '2.13', '2.55', '1.54', 44),
(13, 13, '26.40', '14.20', '1.10', '3.34', '12.50', '22.00', '13.34', 51, 14, 7, 14, 16, 32, 38, 44, 52, '9.00', 12, '24.20', '54.40', '2.12', '2.52', '1.51', 45),
(14, 14, '26.30', '14.10', '1.10', '3.32', '12.45', '21.50', '13.30', 51, 14, 7, 15, 17, 33, 39, 45, 53, '8.90', 12, '24.10', '54.20', '2.11', '2.50', '1.48', 45),
(15, 15, '26.20', '14.00', '1.09', '3.30', '12.40', '21.40', '13.25', 52, 15, 8, 16, 18, 34, 40, 46, 54, '8.80', 13, '24.00', '54.00', '2.10', '2.48', '1.45', 46),
(16, 16, '26.10', '13.90', '1.09', '3.28', '12.35', '21.30', '13.20', 52, 16, 8, 17, 19, 35, 41, 47, 55, '8.70', 13, '23.50', '53.50', '2.09', '2.46', '1.42', 46),
(17, 17, '26.00', '13.80', '1.08', '3.26', '12.30', '21.20', '13.15', 53, 17, 9, 18, 20, 36, 42, 48, 56, '8.60', 14, '23.40', '53.40', '2.08', '2.45', '1.40', 47),
(18, 18, '25.90', '13.70', '1.08', '3.24', '12.20', '21.10', '13.10', 53, 18, 10, 19, 21, 37, 43, 49, 57, '8.50', 14, '23.30', '53.30', '2.06', '2.44', '1.38', 48),
(19, 19, '25.80', '13.60', '1.07', '3.22', '12.10', '21.00', '13.05', 54, 19, 11, 20, 22, 38, 44, 50, 58, '8.40', 15, '23.20', '53.20', '2.04', '2.43', '1.36', 49),
(20, 20, '25.70', '13.50', '1.06', '3.20', '12.00', '20.50', '13.00', 54, 20, 12, 21, 23, 39, 45, 51, 59, '8.30', 15, '23.10', '53.10', '2.02', '2.42', '1.34', 50),
(21, 21, '25.60', '13.40', '1.05', '3.18', '11.50', '20.40', '12.55', 55, 21, 13, 22, 24, 40, 46, 52, 60, '8.20', 16, '23.00', '53.00', '2.00', '2.41', '1.32', 51),
(22, 22, '25.50', '13.30', '1.04', '3.16', '11.40', '20.30', '12.50', 55, 22, 14, 23, 25, 41, 47, 53, 61, '8.10', 17, '22.50', '52.50', '1.58', '2.40', '1.30', 52),
(23, 23, '25.40', '13.20', '1.03', '3.14', '11.30', '20.20', '12.45', 56, 23, 15, 24, 26, 42, 48, 54, 62, '8.00', 18, '22.40', '52.40', '1.56', '2.39', '1.28', 53),
(24, 24, '25.30', '13.10', '1.02', '3.12', '11.20', '20.10', '12.40', 56, 24, 16, 25, 27, 43, 49, 55, 63, '7.90', 19, '22.30', '52.30', '1.54', '2.38', '1.26', 54),
(25, 25, '25.20', '13.00', '1.01', '3.10', '11.10', '20.00', '12.35', 57, 25, 17, 26, 28, 44, 50, 56, 64, '7.80', 20, '22.20', '52.20', '1.52', '2.37', '1.24', 55);

-- --------------------------------------------------------

--
-- Структура таблицы `2guruh`
--

CREATE TABLE `2guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `1-mashq` decimal(4,2) DEFAULT NULL,
  `2-mashq` decimal(4,2) DEFAULT NULL,
  `3-mashq` decimal(4,2) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `5b-mashq` decimal(4,2) DEFAULT NULL,
  `6a-mashq` decimal(4,2) DEFAULT NULL,
  `7a-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `10-mashq` int(11) DEFAULT NULL,
  `131-mashq` int(11) DEFAULT NULL,
  `132-mashq` int(11) DEFAULT NULL,
  `141-mashq` int(11) DEFAULT NULL,
  `142-mashq` int(11) DEFAULT NULL,
  `143-mashq` int(11) DEFAULT NULL,
  `144-mashq` int(11) DEFAULT NULL,
  `16-mashq` decimal(4,2) DEFAULT NULL,
  `23-mashq` int(11) DEFAULT NULL,
  `251-mashq` decimal(4,2) DEFAULT NULL,
  `252-mashq` decimal(4,2) DEFAULT NULL,
  `261-mashq` decimal(4,2) DEFAULT NULL,
  `262-mashq` decimal(4,2) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL,
  `31-mashq` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `2guruh`
--

INSERT INTO `2guruh` (`id`, `ball`, `1-mashq`, `2-mashq`, `3-mashq`, `4-mashq`, `5b-mashq`, `6a-mashq`, `7a-mashq`, `8a-mashq`, `9-mashq`, `10-mashq`, `131-mashq`, `132-mashq`, `141-mashq`, `142-mashq`, `143-mashq`, `144-mashq`, `16-mashq`, `23-mashq`, `251-mashq`, `252-mashq`, `261-mashq`, `262-mashq`, `27a-mashq`, `31-mashq`) VALUES
(1, 1, '28.30', '15.60', '1.17', '4.20', '14.00', '24.20', '14.25', 38, 6, 1, 6, 8, 18, 24, 30, 38, '10.60', 5, '26.20', '58.20', '2.29', '3.35', '2.40', 36),
(2, 2, '28.30', '15.50', '1.17', '4.17', '13.55', '24.10', '14.20', 38, 6, 1, 6, 8, 19, 25, 31, 39, '10.50', 5, '26.10', '58.10', '2.28', '3.35', '2.36', 37),
(3, 3, '28.20', '15.40', '1.16', '4.14', '13.50', '24.00', '14.17', 39, 7, 2, 7, 9, 20, 26, 32, 40, '10.40', 6, '26.00', '58.00', '2.27', '3.35', '2.32', 38),
(4, 4, '28.10', '15.30', '1.16', '4.10', '13.45', '23.50', '14.14', 39, 7, 2, 7, 9, 21, 27, 33, 41, '10.30', 6, '25.50', '57.40', '2.26', '3.30', '2.28', 38),
(5, 5, '28.00', '15.20', '1.15', '4.07', '13.40', '23.40', '14.11', 40, 8, 3, 8, 10, 22, 28, 34, 42, '10.20', 7, '25.40', '57.20', '2.25', '3.30', '2.24', 39),
(6, 6, '27.90', '15.10', '1.15', '4.04', '13.35', '23.30', '14.08', 41, 8, 3, 8, 10, 23, 29, 35, 43, '10.10', 7, '25.30', '57.00', '2.24', '3.25', '2.20', 39),
(7, 7, '27.80', '15.00', '1.14', '4.01', '13.30', '23.20', '14.05', 42, 9, 4, 9, 11, 24, 30, 36, 44, '10.00', 8, '25.20', '56.40', '2.23', '3.25', '2.16', 40),
(8, 8, '27.70', '14.90', '1.14', '3.58', '13.25', '23.10', '14.02', 43, 9, 4, 9, 11, 25, 31, 37, 45, '9.90', 8, '25.10', '56.20', '2.22', '3.20', '2.12', 40),
(9, 9, '27.60', '14.80', '1.13', '3.55', '13.20', '23.00', '13.59', 44, 10, 5, 10, 12, 26, 32, 38, 46, '9.80', 9, '25.00', '56.00', '2.21', '3.20', '2.09', 41),
(10, 10, '27.50', '14.70', '1.13', '3.52', '13.15', '22.50', '13.56', 45, 10, 5, 10, 12, 27, 33, 39, 47, '9.70', 9, '24.50', '55.40', '2.20', '3.15', '2.06', 41),
(11, 11, '27.40', '14.60', '1.12', '3.49', '13.10', '22.40', '13.53', 46, 11, 5, 11, 13, 28, 34, 40, 48, '9.60', 10, '24.40', '55.20', '2.19', '3.15', '2.03', 42),
(12, 12, '27.30', '14.50', '1.12', '3.46', '13.05', '22.30', '13.50', 46, 11, 6, 11, 13, 29, 35, 41, 49, '9.50', 10, '24.30', '55.00', '2.18', '3.10', '2.00', 42),
(13, 13, '27.20', '14.40', '1.11', '3.43', '13.00', '22.20', '13.45', 47, 12, 6, 12, 14, 30, 36, 42, 50, '9.40', 11, '24.20', '54.40', '2.17', '3.10', '1.56', 43),
(14, 14, '27.10', '14.30', '1.11', '3.40', '12.55', '22.10', '13.40', 47, 12, 6, 12, 14, 31, 37, 43, 51, '9.30', 11, '24.10', '54.20', '2.16', '3.05', '1.53', 43),
(15, 15, '27.00', '14.20', '1.10', '3.38', '12.50', '22.00', '13.35', 48, 13, 7, 13, 15, 32, 38, 44, 52, '9.20', 13, '24.00', '54.00', '2.15', '3.05', '1.50', 44),
(16, 16, '26.90', '14.10', '1.10', '3.36', '12.45', '21.50', '13.30', 48, 13, 7, 13, 16, 33, 39, 45, 53, '9.10', 13, '23.50', '53.50', '2.14', '3.00', '1.48', 44),
(17, 17, '26.80', '14.00', '1.09', '3.34', '12.40', '21.40', '13.25', 49, 14, 8, 14, 17, 34, 40, 46, 54, '9.00', 14, '23.40', '53.40', '2.13', '3.00', '1.46', 45),
(18, 18, '26.70', '13.90', '1.09', '3.32', '12.30', '21.30', '13.20', 49, 15, 9, 15, 18, 35, 41, 47, 55, '8.90', 14, '23.30', '53.30', '2.11', '2.55', '1.42', 46),
(19, 19, '26.60', '13.80', '1.08', '3.30', '12.20', '21.20', '13.15', 50, 16, 10, 16, 19, 36, 42, 48, 56, '8.80', 15, '23.20', '53.20', '2.09', '3.00', '1.40', 47),
(20, 20, '26.50', '13.70', '1.08', '3.28', '12.10', '21.10', '13.10', 50, 17, 11, 17, 20, 37, 43, 49, 57, '8.70', 15, '23.10', '53.10', '2.07', '2.50', '1.38', 48),
(21, 21, '26.40', '13.60', '1.07', '3.26', '12.00', '21.00', '13.05', 51, 18, 12, 18, 21, 38, 44, 50, 58, '8.60', 16, '23.00', '53.00', '2.05', '2.50', '1.36', 49),
(22, 22, '26.30', '13.50', '1.07', '3.24', '11.50', '20.50', '13.00', 51, 19, 13, 19, 22, 39, 45, 51, 59, '8.50', 16, '22.50', '52.50', '2.03', '2.45', '1.34', 50),
(23, 23, '26.20', '13.40', '1.06', '3.22', '11.40', '20.40', '12.55', 52, 20, 14, 20, 23, 40, 46, 52, 60, '8.40', 17, '22.40', '52.40', '2.01', '2.45', '1.32', 51),
(24, 24, '26.10', '13.30', '1.06', '3.20', '11.20', '20.30', '12.50', 52, 21, 15, 21, 24, 41, 47, 53, 61, '8.30', 17, '22.30', '52.30', '1.59', '2.45', '1.30', 52),
(25, 25, '26.00', '13.20', '1.05', '3.17', '11.10', '20.20', '12.45', 53, 22, 16, 22, 25, 42, 48, 54, 62, '8.20', 18, '22.20', '52.20', '1.57', '2.40', '1.28', 53);

-- --------------------------------------------------------

--
-- Структура таблицы `3guruh`
--

CREATE TABLE `3guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `1-mashq` decimal(4,2) DEFAULT NULL,
  `2-mashq` decimal(4,2) DEFAULT NULL,
  `3-mashq` decimal(4,2) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `5b-mashq` decimal(4,2) DEFAULT NULL,
  `6a-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `10-mashq` int(11) DEFAULT NULL,
  `131-mashq` int(11) DEFAULT NULL,
  `141-mashq` int(11) DEFAULT NULL,
  `142-mashq` int(11) DEFAULT NULL,
  `143-mashq` int(11) DEFAULT NULL,
  `144-mashq` int(11) DEFAULT NULL,
  `16-mashq` decimal(4,2) DEFAULT NULL,
  `23-mashq` int(11) DEFAULT NULL,
  `251-mashq` decimal(4,2) DEFAULT NULL,
  `252-mashq` decimal(4,2) DEFAULT NULL,
  `261-mashq` decimal(4,2) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `3guruh`
--

INSERT INTO `3guruh` (`id`, `ball`, `1-mashq`, `2-mashq`, `3-mashq`, `4-mashq`, `5b-mashq`, `6a-mashq`, `8a-mashq`, `9-mashq`, `10-mashq`, `131-mashq`, `141-mashq`, `142-mashq`, `143-mashq`, `144-mashq`, `16-mashq`, `23-mashq`, `251-mashq`, `252-mashq`, `261-mashq`, `27a-mashq`) VALUES
(1, 1, '29.40', '16.20', '1.25', '4.46', '15.30', '25.20', 36, 3, 1, 3, 14, 20, 26, 34, '11.00', 3, '26.20', '58.20', '2.39', '3.04'),
(2, 2, '29.30', '16.10', '1.23', '4.43', '15.25', '25.10', 37, 3, 1, 3, 15, 21, 27, 35, '10.90', 3, '26.10', '58.10', '2.38', '3.01'),
(3, 3, '29.20', '16.00', '1.21', '4.40', '15.20', '25.00', 38, 4, 1, 4, 16, 22, 28, 36, '10.80', 4, '26.00', '58.00', '2.37', '2.58'),
(4, 4, '29.10', '15.90', '1.19', '4.37', '15.15', '24.50', 39, 4, 2, 4, 17, 23, 29, 37, '10.70', 4, '25.50', '57.40', '2.36', '2.55'),
(5, 5, '29.00', '15.80', '1.18', '4.33', '15.10', '24.40', 40, 5, 2, 5, 18, 24, 30, 38, '10.60', 4, '25.40', '57.20', '2.35', '2.50'),
(6, 6, '28.90', '15.70', '1.17', '4.30', '15.05', '24.30', 41, 5, 2, 5, 19, 25, 31, 39, '10.50', 5, '25.30', '57.00', '2.34', '2.45'),
(7, 7, '28.80', '15.60', '1.17', '4.27', '15.00', '24.20', 42, 6, 3, 6, 20, 26, 32, 40, '10.40', 5, '25.20', '56.40', '2.33', '2.40'),
(8, 8, '28.70', '15.50', '1.16', '4.24', '14.55', '24.10', 43, 6, 3, 6, 21, 27, 33, 41, '10.30', 5, '25.10', '56.20', '2.32', '2.35'),
(9, 9, '28.60', '15.40', '1.16', '4.21', '14.50', '24.00', 44, 7, 4, 7, 22, 28, 34, 42, '10.20', 6, '25.00', '56.00', '2.31', '2.30'),
(10, 10, '28.50', '15.30', '1.15', '4.18', '14.45', '23.50', 44, 7, 4, 7, 23, 29, 35, 43, '10.10', 6, '24.50', '55.40', '2.30', '2.25'),
(11, 11, '28.40', '15.20', '1.15', '4.15', '14.40', '23.40', 44, 8, 4, 8, 24, 30, 36, 44, '10.00', 7, '24.40', '55.20', '2.29', '2.20'),
(12, 12, '28.30', '15.10', '1.14', '4.12', '14.35', '23.30', 45, 8, 5, 8, 25, 31, 37, 45, '9.90', 7, '24.30', '55.00', '2.28', '2.15'),
(13, 13, '28.20', '15.00', '1.14', '4.10', '14.30', '23.20', 45, 9, 5, 9, 26, 32, 38, 46, '9.80', 8, '24.20', '54.40', '2.27', '2.10'),
(14, 14, '28.10', '14.90', '1.13', '4.08', '14.25', '23.10', 45, 9, 5, 9, 27, 33, 39, 47, '9.70', 8, '24.10', '54.20', '2.26', '2.05'),
(15, 15, '28.00', '14.80', '1.12', '4.05', '14.20', '23.00', 45, 10, 6, 10, 28, 34, 40, 48, '9.60', 9, '24.00', '54.00', '2.25', '2.02'),
(16, 16, '27.90', '14.70', '1.12', '4.02', '14.15', '22.50', 46, 10, 6, 10, 29, 35, 41, 49, '9.50', 9, '23.50', '53.50', '2.24', '1.59'),
(17, 17, '27.80', '14.60', '1.11', '3.59', '14.10', '22.40', 46, 11, 7, 11, 30, 36, 42, 50, '9.40', 10, '23.40', '53.40', '2.23', '1.56'),
(18, 18, '27.70', '14.50', '1.11', '3.56', '14.05', '22.30', 47, 11, 7, 11, 31, 37, 43, 51, '9.30', 10, '23.30', '53.30', '2.21', '1.54'),
(19, 19, '27.60', '14.40', '1.10', '3.53', '14.00', '22.20', 47, 12, 8, 12, 32, 38, 44, 52, '9.20', 11, '23.20', '53.20', '2.19', '1.52'),
(20, 20, '27.50', '14.30', '1.10', '3.50', '13.55', '22.10', 47, 13, 9, 13, 33, 39, 45, 53, '9.10', 11, '23.10', '53.10', '2.17', '1.50'),
(21, 21, '27.40', '14.20', '1.09', '3.48', '13.50', '22.00', 48, 14, 10, 14, 34, 40, 46, 54, '9.00', 12, '23.00', '53.00', '2.15', '1.48'),
(22, 22, '27.30', '14.10', '1.09', '3.46', '13.45', '21.50', 48, 15, 11, 15, 35, 41, 47, 55, '8.90', 12, '22.50', '52.50', '2.13', '1.46'),
(23, 23, '27.20', '14.00', '1.08', '3.44', '13.40', '21.40', 48, 16, 12, 16, 36, 42, 48, 56, '8.80', 13, '22.40', '52.40', '2.11', '1.44'),
(24, 24, '27.10', '13.90', '1.08', '3.42', '13.35', '21.30', 49, 17, 13, 17, 37, 43, 49, 57, '8.70', 13, '22.30', '52.30', '2.09', '1.42'),
(25, 25, '27.00', '13.80', '1.07', '3.40', '13.30', '21.20', 50, 18, 14, 18, 38, 44, 50, 58, '8.60', 14, '22.20', '52.20', '2.07', '1.40');

-- --------------------------------------------------------

--
-- Структура таблицы `4guruh`
--

CREATE TABLE `4guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `1-mashq` decimal(4,2) DEFAULT NULL,
  `2-mashq` decimal(4,2) DEFAULT NULL,
  `3-mashq` decimal(4,2) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `5b-mashq` decimal(4,2) DEFAULT NULL,
  `6a-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `10-mashq` int(11) DEFAULT NULL,
  `131-mashq` int(11) DEFAULT NULL,
  `141-mashq` int(11) DEFAULT NULL,
  `142-mashq` int(11) DEFAULT NULL,
  `143-mashq` int(11) DEFAULT NULL,
  `144-mashq` int(11) DEFAULT NULL,
  `16-mashq` decimal(4,2) DEFAULT NULL,
  `23-mashq` int(11) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `4guruh`
--

INSERT INTO `4guruh` (`id`, `ball`, `1-mashq`, `2-mashq`, `3-mashq`, `4-mashq`, `5b-mashq`, `6a-mashq`, `8a-mashq`, `9-mashq`, `10-mashq`, `131-mashq`, `141-mashq`, `142-mashq`, `143-mashq`, `144-mashq`, `16-mashq`, `23-mashq`, `27a-mashq`) VALUES
(1, 1, '29.90', '16.80', '1.24', '5.15', '16.40', '27.20', 33, 1, 1, 1, 20, 26, 32, 40, '11.20', 1, '3.10'),
(2, 2, '29.80', '16.70', '1.23', '5.15', '16.35', '27.10', 34, 1, 1, 1, 21, 27, 33, 41, '11.10', 1, '3.07'),
(3, 3, '29.70', '16.60', '1.22', '5.10', '16.30', '27.00', 35, 2, 1, 2, 22, 28, 34, 42, '11.00', 2, '3.04'),
(4, 4, '29.60', '16.50', '1.21', '5.05', '16.25', '26.50', 36, 2, 1, 2, 23, 29, 35, 43, '10.90', 2, '3.01'),
(5, 5, '29.50', '16.40', '1.21', '5.00', '16.20', '26.40', 37, 3, 2, 3, 24, 30, 36, 44, '10.80', 3, '2.58'),
(6, 6, '29.40', '16.30', '1.20', '4.55', '16.15', '26.30', 38, 3, 2, 3, 25, 31, 37, 45, '10.70', 3, '2.55'),
(7, 7, '29.30', '16.20', '1.20', '4.50', '16.10', '26.20', 39, 4, 2, 4, 26, 32, 38, 46, '10.60', 3, '2.52'),
(8, 8, '29.20', '16.10', '1.19', '4.45', '16.00', '26.10', 40, 4, 2, 4, 27, 33, 39, 47, '10.50', 4, '2.49'),
(9, 9, '29.10', '16.00', '1.18', '4.40', '15.50', '26.00', 41, 5, 3, 5, 28, 34, 40, 48, '10.40', 4, '2.46'),
(10, 10, '29.00', '15.90', '1.18', '4.35', '15.40', '25.50', 42, 5, 3, 5, 29, 35, 41, 49, '10.30', 4, '2.43'),
(11, 11, '28.90', '15.80', '1.18', '4.31', '15.30', '25.40', 42, 6, 3, 6, 30, 36, 42, 50, '10.20', 5, '2.40'),
(12, 12, '28.80', '15.70', '1.17', '4.27', '15.20', '25.30', 43, 6, 3, 6, 31, 37, 43, 51, '10.10', 5, '2.35'),
(13, 13, '28.70', '15.60', '1.17', '4.23', '15.10', '25.20', 43, 7, 4, 7, 32, 38, 44, 52, '10.00', 5, '2.30'),
(14, 14, '28.60', '15.50', '1.16', '4.19', '15.00', '25.10', 43, 7, 4, 7, 33, 39, 45, 53, '9.90', 6, '2.25'),
(15, 15, '28.50', '15.40', '1.15', '4.15', '14.50', '25.00', 44, 8, 4, 8, 34, 40, 46, 54, '9.80', 6, '2.22'),
(16, 16, '28.40', '15.30', '1.15', '4.12', '14.45', '24.50', 44, 8, 5, 8, 35, 41, 47, 55, '9.70', 7, '2.19'),
(17, 17, '28.30', '15.20', '1.15', '4.10', '14.40', '24.40', 44, 9, 5, 9, 36, 42, 48, 56, '9.60', 7, '2.16'),
(18, 18, '28.20', '15.10', '1.14', '4.08', '14.35', '24.30', 45, 9, 6, 9, 37, 43, 49, 57, '9.50', 7, '2.13'),
(19, 19, '28.10', '15.00', '1.14', '4.06', '14.30', '24.20', 45, 10, 6, 10, 38, 44, 50, 58, '9.40', 8, '2.10'),
(20, 20, '28.00', '14.90', '1.14', '4.04', '14.25', '24.10', 45, 11, 7, 11, 39, 45, 51, 59, '9.30', 8, '2.07'),
(21, 21, '27.90', '14.80', '1.13', '4.02', '14.20', '24.00', 46, 12, 7, 12, 40, 46, 52, 60, '9.20', 8, '2.04'),
(22, 22, '27.80', '14.70', '1.13', '4.00', '14.15', '23.50', 46, 13, 8, 13, 41, 47, 53, 61, '9.10', 9, '2.01'),
(23, 23, '27.70', '14.60', '1.12', '3.58', '14.10', '23.40', 46, 14, 8, 14, 42, 48, 54, 62, '9.00', 9, '1.58'),
(24, 24, '27.60', '14.50', '1.12', '3.56', '14.05', '23.30', 47, 15, 9, 15, 43, 49, 55, 63, '8.90', 10, '1.55'),
(25, 25, '27.50', '14.40', '1.11', '3.54', '14.00', '23.20', 48, 16, 10, 16, 44, 50, 56, 64, '8.80', 11, '1.52');

-- --------------------------------------------------------

--
-- Структура таблицы `5guruh`
--

CREATE TABLE `5guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `141-mashq` int(11) DEFAULT NULL,
  `142-mashq` int(11) DEFAULT NULL,
  `143-mashq` int(11) DEFAULT NULL,
  `144-mashq` int(11) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `5guruh`
--

INSERT INTO `5guruh` (`id`, `ball`, `4-mashq`, `8a-mashq`, `9-mashq`, `141-mashq`, `142-mashq`, `143-mashq`, `144-mashq`, `27a-mashq`) VALUES
(1, 1, '5.40', 32, 1, 16, 22, 28, 36, '3.20'),
(2, 2, '5.36', 32, 1, 17, 23, 29, 37, '3.17'),
(3, 3, '5.32', 32, 1, 18, 24, 30, 38, '3.14'),
(4, 4, '5.28', 33, 2, 19, 25, 31, 39, '3.11'),
(5, 5, '5.24', 33, 3, 20, 26, 32, 40, '3.08'),
(6, 6, '5.20', 33, 3, 21, 27, 33, 41, '3.05'),
(7, 7, '5.16', 34, 3, 22, 28, 34, 42, '3.02'),
(8, 8, '5.12', 34, 4, 23, 29, 35, 43, '2.59'),
(9, 9, '5.08', 34, 4, 24, 30, 36, 44, '2.56'),
(10, 10, '5.04', 35, 4, 25, 31, 37, 45, '2.53'),
(11, 11, '5.00', 35, 5, 26, 32, 38, 46, '2.50'),
(12, 12, '4.56', 35, 5, 27, 33, 39, 47, '2.47'),
(13, 13, '4.52', 36, 5, 28, 34, 40, 48, '2.44'),
(14, 14, '4.48', 36, 6, 29, 35, 41, 49, '2.41'),
(15, 15, '4.45', 36, 6, 30, 36, 42, 50, '2.38'),
(16, 16, '4.42', 37, 6, 31, 37, 43, 51, '2.35'),
(17, 17, '4.39', 37, 7, 32, 38, 44, 52, '2.32'),
(18, 18, '4.36', 37, 7, 33, 39, 45, 53, '2.29'),
(19, 19, '4.33', 38, 7, 34, 40, 46, 54, '2.26'),
(20, 20, '4.30', 38, 8, 35, 41, 47, 55, '2.23'),
(21, 21, '4.27', 38, 8, 36, 42, 48, 56, '2.20'),
(22, 22, '4.24', 39, 9, 37, 43, 49, 57, '2.17'),
(23, 23, '4.21', 39, 9, 38, 44, 50, 58, '2.14'),
(24, 24, '4.18', 39, 9, 39, 45, 51, 59, '2.11'),
(25, 25, '4.15', 40, 10, 40, 46, 52, 60, '2.08');

-- --------------------------------------------------------

--
-- Структура таблицы `6guruh`
--

CREATE TABLE `6guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `6guruh`
--

INSERT INTO `6guruh` (`id`, `ball`, `4-mashq`, `8a-mashq`, `9-mashq`, `27a-mashq`) VALUES
(1, 1, '5.50', 30, 1, '3.30'),
(2, 2, '5.46', 30, 1, '3.27'),
(3, 3, '5.42', 30, 1, '3.24'),
(4, 4, '5.38', 31, 1, '3.21'),
(5, 5, '5.34', 31, 2, '3.18'),
(6, 6, '5.30', 31, 2, '3.15'),
(7, 7, '5.26', 32, 2, '3.12'),
(8, 8, '5.22', 32, 2, '3.09'),
(9, 9, '5.18', 32, 3, '3.06'),
(10, 10, '5.14', 33, 3, '3.03'),
(11, 11, '5.10', 33, 3, '3.00'),
(12, 12, '5.06', 33, 3, '2.57'),
(13, 13, '5.02', 34, 4, '2.54'),
(14, 14, '4.58', 34, 4, '2.51'),
(15, 15, '4.55', 34, 4, '2.48'),
(16, 16, '4.52', 35, 5, '2.45'),
(17, 17, '4.49', 35, 5, '2.42'),
(18, 18, '4.46', 35, 5, '2.39'),
(19, 19, '4.43', 36, 6, '2.36'),
(20, 20, '4.40', 36, 6, '2.33'),
(21, 21, '4.37', 36, 6, '2.30'),
(22, 22, '4.34', 37, 7, '2.27'),
(23, 23, '4.31', 37, 7, '2.24'),
(24, 24, '4.28', 37, 7, '2.21'),
(25, 25, '4.25', 38, 8, '2.18');

-- --------------------------------------------------------

--
-- Структура таблицы `7guruh`
--

CREATE TABLE `7guruh` (
  `id` int(11) NOT NULL,
  `ball` int(11) DEFAULT NULL,
  `4-mashq` decimal(4,2) DEFAULT NULL,
  `8a-mashq` int(11) DEFAULT NULL,
  `9-mashq` int(11) DEFAULT NULL,
  `27a-mashq` decimal(4,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `7guruh`
--

INSERT INTO `7guruh` (`id`, `ball`, `4-mashq`, `8a-mashq`, `9-mashq`, `27a-mashq`) VALUES
(1, 1, '6.10', 26, 1, '3.40'),
(2, 2, '6.05', 26, 1, '3.37'),
(3, 3, '6.00', 26, 1, '3.34'),
(4, 4, '5.55', 27, 1, '3.31'),
(5, 5, '5.50', 27, 2, '3.28'),
(6, 6, '5.45', 27, 2, '3.25'),
(7, 7, '5.40', 28, 2, '3.22'),
(8, 8, '5.35', 28, 2, '3.19'),
(9, 9, '5.30', 28, 2, '3.16'),
(10, 10, '5.25', 29, 3, '3.13'),
(11, 11, '5.22', 29, 3, '3.10'),
(12, 12, '5.19', 29, 3, '3.07'),
(13, 13, '5.16', 30, 3, '3.04'),
(14, 14, '5.13', 30, 3, '3.01'),
(15, 15, '5.10', 30, 4, '2.58'),
(16, 16, '5.07', 31, 4, '2.55'),
(17, 17, '5.04', 31, 4, '2.52'),
(18, 18, '5.01', 31, 4, '2.49'),
(19, 19, '4.58', 32, 4, '2.46'),
(20, 20, '4.55', 32, 5, '2.43'),
(21, 21, '4.52', 32, 5, '2.40'),
(22, 22, '4.48', 33, 5, '2.37'),
(23, 23, '4.45', 33, 5, '2.34'),
(24, 24, '4.42', 33, 5, '2.31'),
(25, 25, '4.40', 34, 6, '2.28');

-- --------------------------------------------------------

--
-- Структура таблицы `counter_table`
--

CREATE TABLE `counter_table` (
  `id` int(11) NOT NULL,
  `ip_address` text NOT NULL,
  `visit_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `ip_username` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `counter_table`
--

INSERT INTO `counter_table` (`id`, `ip_address`, `visit_date`, `ip_username`) VALUES
(1, '::1', '2023-05-18 11:08:00', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `mashqlar`
--

CREATE TABLE `mashqlar` (
  `mashqlar_id` int(11) NOT NULL,
  `mashq_nomi` varchar(255) NOT NULL,
  `mashq_tuliq_nomi` varchar(255) NOT NULL,
  `mashq_server_nomi` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `mashqlar`
--

INSERT INTO `mashqlar` (`mashqlar_id`, `mashq_nomi`, `mashq_tuliq_nomi`, `mashq_server_nomi`) VALUES
(1, '1-mashq', '10x10 metr masofaga moki yugurish mashqi', 't'),
(2, '2-mashq', '100 metrga yugurish mashqi', 't'),
(3, '3-mashq', '400 metrga yugurish mashqi', 't'),
(4, '4-mashq', '1000 metrga yugurish mashqi', 't'),
(5, '5b-mashq', '3000 metrga yugurish mashqi', 't'),
(6, '6a-mashq', '5000 metrga yugurish mashqi', 't'),
(7, '7a-mashq', '3 kilometrga anjom-aslaha (qurol) bilan yugurish mashqi', 't'),
(8, '8a-mashq', 'Kuch ishlatiladigan mashqlar kompleksi', 'c'),
(9, '9-mashq', 'Turnikda tortilish', 'c'),
(10, '10-mashq', 'Turnikda oyoqlarni yuqoriga ko\'tarib aylanish', 'c'),
(11, '131-mashq', 'Brusda qo\'llarni bukish va to\'g\'irlash', 'c'),
(12, '132-mashq', 'Brusda qo\'l bukish va to\'g\'irlash mashqi, brusda tebrangan tarzda', 'c'),
(13, '14-mashq', '24 kilogrammli toshni siltab ko\'tarish', 'c'),
(14, '16-mashq', 'Chaqqonlikni shakllantiruvchi mashqlar kompleksi', 't'),
(15, '23-mashq', 'Brusda qo\'lga tayanib, tanani burchak hosil qilib turish', 'c'),
(16, '251-mashq', 'Bo\'linma tarkibida 5 kilometrga marsh yugurish', 't'),
(18, '252-mashq', 'Bo\'linma tarkibida 10 kilometrga marsh yugurish', 't'),
(19, '261-mashq', 'Yagona to\'siqlar yo\'lagida bajariladigan UNM', 't'),
(20, '262-mashq', 'To\'siqlar yo\'lagida bajariladigan MNM', 't'),
(21, '27a-mashq', 'Erkin uslubda 100 metrga suzish', 't'),
(22, '31-mashq', 'F-1 rusumli o\'quv granatasini uzoqqa uloqtirish', 'c');

-- --------------------------------------------------------

--
-- Структура таблицы `user401`
--

CREATE TABLE `user401` (
  `user_id` int(11) NOT NULL,
  `fish` varchar(255) DEFAULT NULL,
  `tugilgan_kuni` date DEFAULT NULL,
  `yoshi` int(11) DEFAULT NULL,
  `vazni` int(11) DEFAULT NULL,
  `guruhi` varchar(255) DEFAULT NULL,
  `natija1` varchar(255) DEFAULT NULL,
  `ball1` int(11) DEFAULT NULL,
  `natija2` varchar(255) DEFAULT NULL,
  `ball2` int(11) DEFAULT NULL,
  `natija3` varchar(255) DEFAULT NULL,
  `ball3` int(11) DEFAULT NULL,
  `natija4` varchar(255) DEFAULT NULL,
  `ball4` int(11) DEFAULT NULL,
  `umumiyball` int(11) DEFAULT NULL,
  `baho` int(11) DEFAULT NULL,
  `current_time` date NOT NULL DEFAULT current_timestamp(),
  `bolinma_nomi` varchar(11) DEFAULT NULL,
  `data_username` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `user401`
--

INSERT INTO `user401` (`user_id`, `fish`, `tugilgan_kuni`, `yoshi`, `vazni`, `guruhi`, `natija1`, `ball1`, `natija2`, `ball2`, `natija3`, `ball3`, `natija4`, `ball4`, `umumiyball`, `baho`, `current_time`, `bolinma_nomi`, `data_username`) VALUES
(52, '12', '1993-09-12', 29, NULL, '2guruh', '4', 7, '13', 13, '21', 21, '22.00', 25, 66, 3, '2023-05-24', '999', 'Turon'),
(53, 'Salimov suxrob', '1994-06-27', 28, NULL, '2guruh', '1.05', 25, '20.30', 24, '12', 14, '12', 0, 63, 3, '2023-06-01', '5-guruh', 'Kamol'),
(54, 'Sattor', '1993-09-12', 29, NULL, '2guruh', '12.10', 0, '12', 25, '12', 14, '12', 0, 39, 2, '2023-06-01', '5-guruh', 'Kamol'),
(55, 'Saxi', '1992-09-12', 30, NULL, '2guruh', '3.28', 20, '13.2', 25, '12.50', 25, '15', 18, 88, 5, '2023-06-07', '1-guruh', 'ILYA'),
(56, 'Pozilov Ortiq Elmurodovich', '1992-02-12', 31, NULL, '2guruh', '12.10', 0, '13', 13, '15', 25, '13', 16, 54, 0, '2023-06-07', '999', 'Turon'),
(57, 'Anvarov Sarvar', '1993-09-12', 29, NULL, '2guruh', '4.17', 2, '13.45', 4, '24.20', 1, '12', 14, 21, 2, '2023-06-08', '999', 'Turon'),
(58, 'Dunyo', '2000-08-12', 22, NULL, '1guruh', '12', 3, '12', 3, '12', 0, '12', 0, 6, 2, '2023-06-08', '342', 'Olim'),
(59, 'Рустамович', '1993-09-12', 29, NULL, '2guruh', '12', 0, '12', 25, '12', 14, '12', 0, 39, 0, '2023-06-20', '5-guruh', 'Kamol'),
(87, '4555', '1985-12-06', 37, NULL, '3guruh', '14.2', 21, '3.50', 20, '12', 19, '8.8', 23, 83, 5, '2023-07-05', '203', 'Saxi'),
(88, 'Mirzayev', '1988-04-17', 35, NULL, '3guruh', '14.0', 23, '3.53', 19, '12', 19, '8.8', 23, 84, 5, '2023-07-05', '203', 'Saxi'),
(89, 'Asqarov', '1989-11-10', 33, NULL, '3guruh', '15.0', 13, '3.27', 25, '8', 12, '10.0', 11, 61, 4, '2023-07-05', '203', 'Saxi'),
(90, 'Tojaliyev', '1990-01-28', 33, NULL, '3guruh', '14.3', 20, '3.28', 25, '13', 20, '9.1', 20, 85, 5, '2023-07-05', '203', 'Saxi'),
(91, 'Tojaliyev', '1990-01-28', 33, NULL, '3guruh', '14.3', 20, '3.28', 25, '12', 19, '9.1', 20, 84, 5, '2023-07-05', '203', 'Saxi'),
(92, '123', '1990-01-28', 33, NULL, '3guruh', '14.3', 20, '3.28', 25, '12', 19, '9.1', 20, 84, 5, '2023-07-05', '203', 'Saxi'),
(93, '123', '1989-01-28', 34, NULL, '3guruh', '14.3', 20, '3.28', 25, '12', 19, '9.1', 20, 84, 5, '2023-07-05', '203', 'Saxi'),
(94, '123', '1990-01-28', 33, NULL, '3guruh', '14.3', 20, '3.28', 25, '12', 19, '9.1', 20, 84, 5, '2023-07-05', '203', 'Saxi'),
(96, 'Pozilov Ortiq Elmurodovich', '1988-10-23', 34, NULL, '3guruh', '13.30', 25, '3.26', 25, '16', 23, '8.60', 25, 98, 5, '2023-07-06', '1-vzvod', 'Kamolliddin');

-- --------------------------------------------------------

--
-- Структура таблицы `userbolinma`
--

CREATE TABLE `userbolinma` (
  `userbolinma_id` int(11) NOT NULL,
  `bolinma_nomi` varchar(255) NOT NULL,
  `yaratilgan_vaqti` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `userbolinma`
--

INSERT INTO `userbolinma` (`userbolinma_id`, `bolinma_nomi`, `yaratilgan_vaqti`) VALUES
(1, '401', '2023-03-10');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `bolinmanomi` varchar(255) DEFAULT NULL,
  `1-mashq` varchar(255) DEFAULT NULL,
  `2-mashq` varchar(255) DEFAULT NULL,
  `3-mashq` varchar(255) DEFAULT NULL,
  `4-mashq` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `name`, `bolinmanomi`, `1-mashq`, `2-mashq`, `3-mashq`, `4-mashq`) VALUES
(8, '1111', 'b59c67bf196a4758191e42f76670ceba', '1111', NULL, NULL, NULL, NULL, NULL),
(9, 'admin', '21232f297a57a5a743894a0e4a801fc3', 'admin', NULL, NULL, NULL, NULL, NULL),
(10, 'ILYA', '26c509535026fc01418a8dd812cc2cc6', 'ILYA', '1-guruh', '4', '2', '6', '9'),
(14, 'Fozil', '13d95ac68bbef016e975c1955b39e560', 'Fozil', NULL, NULL, NULL, NULL, NULL),
(15, 'Jamshid', '9f47e7106c571bba2d6ca4b27d586351', 'Jamshid', NULL, NULL, NULL, NULL, NULL),
(16, 'Sattor', 'de5a125a4ee3492456cd975d2bb537cd', 'Sattor', NULL, NULL, NULL, NULL, NULL),
(17, 'Kamol', 'a265ac79781878928c0339a6ae93fbd8', 'Kamol', '5-guruh', '3', '6', '9', '8'),
(18, 'Suxrob', '49d475e3861478d2c57ec40689beb486', 'Suxrob', NULL, NULL, NULL, NULL, NULL),
(19, 'Turon', 'b4d0c71e0f674d41d2bbde1d1e1fd179', 'Turon', '999', '4', '5', '6', '9'),
(20, 'Saxi', 'aef306db24871aaf73365eb38aafd2c5', 'Saxi', '203', '2', '4', '9', '14'),
(21, 'Olim', '95b0174a7e8cde3463acb027828138c0', 'Olim', '342', '1', '2', '3', '4'),
(22, 'Kamolliddin', 'a265ac79781878928c0339a6ae93fbd8', 'Kamoliddin', '1-vzvod', '2', '4', '9', '14');

-- --------------------------------------------------------

--
-- Структура таблицы `yoshguruh`
--

CREATE TABLE `yoshguruh` (
  `id` int(11) NOT NULL,
  `yoshi` int(11) NOT NULL,
  `guruhi` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `yoshguruh`
--

INSERT INTO `yoshguruh` (`id`, `yoshi`, `guruhi`) VALUES
(1, 17, '1guruh'),
(2, 28, '2guruh'),
(3, 33, '3guruh'),
(4, 38, '4guruh'),
(5, 43, '5guruh'),
(6, 48, '6guruh'),
(7, 53, '7guruh');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `1guruh`
--
ALTER TABLE `1guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `2guruh`
--
ALTER TABLE `2guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `3guruh`
--
ALTER TABLE `3guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `4guruh`
--
ALTER TABLE `4guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `5guruh`
--
ALTER TABLE `5guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `6guruh`
--
ALTER TABLE `6guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `7guruh`
--
ALTER TABLE `7guruh`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `counter_table`
--
ALTER TABLE `counter_table`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `mashqlar`
--
ALTER TABLE `mashqlar`
  ADD PRIMARY KEY (`mashqlar_id`);

--
-- Индексы таблицы `user401`
--
ALTER TABLE `user401`
  ADD PRIMARY KEY (`user_id`);

--
-- Индексы таблицы `userbolinma`
--
ALTER TABLE `userbolinma`
  ADD PRIMARY KEY (`userbolinma_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `yoshguruh`
--
ALTER TABLE `yoshguruh`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `1guruh`
--
ALTER TABLE `1guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `2guruh`
--
ALTER TABLE `2guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `3guruh`
--
ALTER TABLE `3guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `4guruh`
--
ALTER TABLE `4guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `5guruh`
--
ALTER TABLE `5guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `6guruh`
--
ALTER TABLE `6guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `7guruh`
--
ALTER TABLE `7guruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `counter_table`
--
ALTER TABLE `counter_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `mashqlar`
--
ALTER TABLE `mashqlar`
  MODIFY `mashqlar_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `user401`
--
ALTER TABLE `user401`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=97;

--
-- AUTO_INCREMENT для таблицы `userbolinma`
--
ALTER TABLE `userbolinma`
  MODIFY `userbolinma_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `yoshguruh`
--
ALTER TABLE `yoshguruh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
